package main.home021;

import java.util.Scanner;

/*
(2 балла) Создать программу генерирующую пароль.
На вход подается число N — длина желаемого пароля. Необходимо проверить,
что N >= 8, иначе вывести на экран "Пароль с N количеством символов
небезопасен" (подставить вместо N число) и предложить пользователю еще раз
ввести число N.
Если N >= 8 то сгенерировать пароль, удовлетворяющий условиям ниже и
вывести его на экран. В пароле должны быть:
● заглавные латинские символы
● строчные латинские символы
● числа
● специальные знаки(_*-)
входные данные:
8

 */
public class HomeWork11 {
    public static void main(String[] args) {
        var sc = new Scanner(System.in);
        System.out.println("Введите желаемую длину пароля не менее 8 символов: ");
        int n = sc.nextInt();
        if (!(n >= 8)) {
            System.out.println("Пароль с " + n +  " количеством символов небезопасен");;
        } else {
            System.out.println("Введите еще раз длину пароля, более 8 символов");
            return;
        }


        String[] upperCase = {"а", "б", "в", "г", "д", "е", "ж", "з", "и", "й", "к", "л", "м", "н", "о", "п", "р", "с",
                "т", "у", "ф", "х", "ц", "ч", "ш", "щ", "ь", "ы", "ъ", "э", "ю", "я"};
        String[] lowerCase = {"А", "Б", "В", "Г", "Д", "Е", "Ж", "З", "И", "Й", "К", "Л", "М", "Н", "О", "П", "Р", "С",
                "Т", "У", "Ф", "Х", "Ц", "Ч", "Ш", "Щ", "Ь", "Ы", "Ъ", "Э", "Ю", "Я"};
        String[] digit = {"1", "2", "3", "4", "5", "6", "7", "8", "9", "0"};
        String[] symbols = {"_", "*", "-"};

    }
}
