package main.home041;
/*
Дополнительные задачи (с собеседований):
Рекомендовано следующие задачи решать сначала “на бумаге”, т.е. не в специальных
редакторах кода и по возможности без подсказок/поиска в интернете. Таким образом
поставить себя в среду, максимально близкую к собеседованиям.
1. На вход подается число n и массив целых чисел длины n.
Вывести два максимальных числа в этой последовательности.
Пояснение: Вторым максимальным числом считается тот, который окажется
максимальным после вычеркивания первого максимума.
Входные данные:
5
1 3 5 4 5

3
3 2 1

Выходные данные:
5 5
3 2

2. На вход подается число n, массив целых чисел отсортированных по
возрастанию длины n и число p. Необходимо найти индекс элемента массива
равного p. Все числа в массиве уникальны. Если искомый элемент не найден,
вывести -1.
Решить задачу за логарифмическую сложность.
входные данные:
5
-42 -12 3 5 8
5

2
17 19
20
выходные данные:
3

-1
 */
public class TaskDop {
}
