package main.home031;
/*
8.	Реализовать класс “банкомат” Atm.
Класс должен:
●	Содержать конструктор, позволяющий задать курс валют перевода долларов в рубли и курс валют перевода рублей
в доллары (можно выбрать и задать любые положительные значения)
●	Содержать два публичных метода, которые позволяют переводить переданную сумму рублей в доллары и долларов
в рубли
●	Хранить приватную переменную счетчик — количество созданных инстансов класса Atm и публичный метод, возвращающий
этот счетчик (подсказка: реализуется через static)

 */
public class HomeWork08 {
}
