package main.home031;
/*
2.	Необходимо реализовать класс Student.
У класса должны быть следующие приватные поля:
●	String name — имя студента
●	String surname — фамилия студента
●	int[] grades — последние 10 оценок студента. Их может быть меньше, но не может быть больше 10.
И следующие публичные методы:
●	геттер/сеттер для name
●	геттер/сеттер для surname
●	геттер/сеттер для grades
●	метод, добавляющий новую оценку в grades. Самая первая оценка должна быть удалена, новая должна сохраниться
в конце массива (т.е. массив должен сдвинуться на 1 влево).
●	метод, возвращающий средний балл студента (рассчитывается как среднее арифметическое от всех оценок в массиве
grades)

 */
public class HomeWork02 {
}
